src/InformationRegisters/НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Зн</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.РолиДоступа</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>777</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.НаименованиеНастройки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиСистемы/Forms/ФормаНастройки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСистемы.ИмяНастройки КАК ИмяНастройки,
	               |	НастройкиСистемы.Зн КАК Зн
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемы КАК НастройкиСистемы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.НаименованиеНастройки КАК НаименованиеНастройки
	               |		ПО НастройкиСистемы.ИмяНастройки = НаименованиеНастройки.Ссылка";
	
	ТБл = Запрос.Выполнить().Выгрузить();
	Стк = новый структура();
	Для каждого Стр из Тбл Цикл
		Стк.Вставить(XMLСтрока(Стр.ИмяНастройки),Стр.Зн); 
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,стк);
	
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Для каждого Эл из Элементы Цикл
		Если ТипЗнч(Эл)<>Тип("ПолеФормы") Тогда ПродолжитЬ; КонецЕСЛИ;
		глДоступ.УстановитьНАстройку(Эл.Имя,ЭтаФорма[Эл.Имя]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписок(Команда)
	ПолучитьФорму("РегистрСведений.НастройкиСистемы.Форма.ФормаСписка").Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОрганизации(Команда)
	глВыгрузкаДанных.ЗагрузитьНоменклатуруАлга("ALLORG");
КонецПроцедуры
